Revit 2023 API
GroupTypeId.AnalyticalProperties Property
 "Analytical Properties"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalProperties { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalProperties As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalProperties {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace